# Шаг 1: Указываем базовый образ
# Мы берем официальный образ Python версии 3.12 в "slim"-варианте.
# Он содержит только самое необходимое, что делает наш итоговый образ меньше.
FROM python:3.12-slim

# Шаг 2: Устанавливаем рабочую директорию внутри контейнера
# Все последующие команды будут выполняться в этой папке.
WORKDIR /app

# Шаг 3: Копируем файлы из текущей папки (.) в рабочую директорию контейнера (/app)
# Мы копируем только файлы с кодом и зависимостями.
COPY requirements.txt .
COPY app.py .

# Шаг 4: Устанавливаем зависимости
# Эта команда выполняется один раз при сборке образа.
# Docker кэширует этот слой, и если requirements.txt не меняется,
# он не будет переустанавливать зависимости при каждой сборке.
RUN pip install --no-cache-dir -r requirements.txt

# Шаг 5: Указываем порт, который "слушает" наше приложение внутри контейнера
# Это просто метаданные, информация для пользователя образа.
EXPOSE 5000

# Шаг 6: Указываем команду для запуска приложения
# Эта команда выполнится, когда контейнер будет запущен.
CMD ["python3", "./app.py"]
